CCNA Day 21 Lab: OSPF Routing Configuration and Verification


Lab Objective
The objective of this lab is to configure OSPF (Open Shortest Path First) between routers to enable efficient and scalable route sharing across networks. You’ll build a simple topology with two routers and two PCs, assign IP addresses, configure interfaces, and enable OSPF to dynamically exchange routes. This lab strengthens your understanding of OSPF areas, cost metrics, neighbor relationships, and LSAs (Link-State Advertisements).

Step-by-Step Instructions
Step 1: Build the Topology in Packet Tracer
Devices Required:

2 Routers (R1 and R2)
2 PCs (PC1 and PC2)
Connections:
PC1 ⟶ R1 (FastEthernet0/0)
R1 ⟶ R2 (Serial0/0/0)
R2 ⟶ PC2 (FastEthernet0/0)


Note: Select the 2811 Router. Click the router → Physical tab → click the green light to power off.Attach the WIC-2T module in the black slots under “Original Size” (zoom in if needed). Click the green light again to power on the router.

Step 2: Configure Router Hostnames
On R1:
Router> enable  
Router# configure terminal  
Router(config)# hostname R1
On R2:
Router> enable  
Router# configure terminal  
Router(config)# hostname R2


Step 3: Configure IP Addresses on Router Interfaces
On R1:
R1(config)# interface FastEthernet0/0  
R1(config-if)# ip address 192.168.1.1 255.255.255.0  
R1(config-if)# no shutdown  
R1(config)# interface Serial0/0/0  
R1(config-if)# ip address 10.0.0.1 255.0.0.0  
R1(config-if)# no shutdown
On R2:
R2(config)# interface FastEthernet0/0  
R2(config-if)# ip address 192.168.2.1 255.255.255.0  
R2(config-if)# no shutdown  
R2(config)# interface Serial0/0/0  
R2(config-if)# ip address 10.0.0.2 255.0.0.0  
R2(config-if)# no shutdown


Step 4: Configure IP Addresses on PCs
On PC1:
IP Address: 192.168.1.10
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.1.1
On PC2:
IP Address: 192.168.2.10
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.2.1


Step 5: Enable OSPF Routing Protocol
On R1:
R1(config)# router ospf 1       ← (Process ID: locally significant)  
R1(config-router)# network 192.168.1.0 0.0.0.255 area 0  
R1(config-router)# network 10.0.0.0 0.255.255.255 area 0
On R2:
R2(config)# router ospf 1       ← (Process ID must match for ease of config)  
R2(config-router)# network 192.168.2.0 0.0.0.255 area 0  
R2(config-router)# network 10.0.0.0 0.255.255.255 area 0


Step 6: Verify Routing Tables
On both routers:
R1# show ip route  
R2# show ip route
You should see OSPF-learned routes marked with an "O" code.


Step 7: Test Connectivity
From PC1: ping 192.168.2.10
From PC2: ping 192.168.1.10
Expected Result: Successful ping replies if OSPF is correctly configured and routes are dynamically learned.


Final Notes
This lab demonstrates how OSPF automatically shares routes between routers using a link-state approach, offering faster convergence and loop-free topologies. OSPF is open-standard, supports VLSM, and can scale from small to very large enterprise networks by dividing them into areas.