CCNA Day-20 Lab: Administrative Distance with RIP and EIGRP


Lab Objective
The objective of this lab is to demonstrate how routers choose routing protocols based on administrative distance (AD). You’ll configure RIP first, then add EIGRP, and observe how the router prefers EIGRP due to its lower AD. Finally, you’ll manually adjust RIP’s AD to be lower than EIGRP, causing the router to switch back to RIP. This lab strengthens your understanding of route selection, routing tables, and the importance of administrative distance.

Step by Step Instructions
Step 1: Build the Topology in Packet Tracer
Devices Required:
2 Routers (R1 and R2)
2 PCs (PC1 and PC2)
Connections:
PC1 ⟶ R1 (FastEthernet0/0)
R1 ⟶ R2 (Serial0/0/0)
R2 ⟶ PC2 (FastEthernet0/0)


Step 2: Configure Router Hostnames
On R1:
Router> enable  
Router# configure terminal  
Router(config)# hostname R1
On R2:
Router> enable  
Router# configure terminal  
Router(config)# hostname R2


Step 3: Configure IP Addresses on Router Interfaces
On R1:
R1(config)# interface FastEthernet0/0  
R1(config-if)# ip address 192.168.1.1 255.255.255.0  
R1(config-if)# no shutdown  
R1(config)# interface Serial0/0/0  
R1(config-if)# ip address 10.0.0.1 255.255.255.0  
R1(config-if)# no shutdown

On R2:
R2(config)# interface FastEthernet0/0  
R2(config-if)# ip address 192.168.2.1 255.255.255.0  
R2(config-if)# no shutdown  
R2(config)# interface Serial0/0/0  
R2(config-if)# ip address 10.0.0.2 255.255.255.0  
R2(config-if)# no shutdown


Step 4: Configure IP Addresses on PCs
On PC1:
IP Address: 192.168.1.10
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.1.1
On PC2:
IP Address: 192.168.2.10
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.2.1


Step 5: Configure RIP Routing Protocol (Initial Setup)
On R1:
R1(config)# router rip
R1(config-router)# version 2
R1(config-router)# network 192.168.1.0
R1(config-router)# network 10.0.0.0
On R2:
R2(config)# router rip
R2(config-router)# version 2
R2(config-router)# network 192.168.2.0
R2(config-router)# network 10.0.0.0

Check the routing table:
R1# show ip route
R2# show ip route
You should see RIP routes (R) in the table.

Step 6: Configure EIGRP (Second Protocol Added)
On R1:
R1(config)# router eigrp 100
R1(config-router)# network 192.168.1.0
R1(config-router)# network 10.0.0.0
On R2:
R2(config)# router eigrp 100
R2(config-router)# network 192.168.2.0
R2(config-router)# network 10.0.0.0

Verify the routing table:
R1# show ip route
R2# show ip route
Now routes should appear as EIGRP routes (D) because EIGRP AD = 90 is better than RIP AD = 120.


Step 7: Change RIP Administrative Distance
On R1:
R1(config)# router rip
R1(config-router)# distance 50
On R2:
R2(config)# router rip
R2(config-router)# distance 50


Verify again:
R1# show ip route
R2# show ip route
Now the router should switch back to RIP routes (R) because RIP AD = 50 is now lower than EIGRP AD = 90.


Step 8: Test Connectivity
From PC1, ping PC2 (192.168.2.10).
From PC2, ping PC1 (192.168.1.10).
Expected Result: Successful ping replies in all cases, regardless of which protocol is active.


Final Notes
This lab demonstrates how a router chooses between routing protocols based on administrative distance (AD). By default, EIGRP is preferred over RIP, but by manually lowering RIP’s AD, it becomes the preferred protocol. This knowledge is critical for controlling route selection and troubleshooting routing issues in real-world networks.