CCNA Day 22 Lab: OSPF Routing Configuration and Verification

Lab Objective
The objective of this lab is to configure OSPF (Open Shortest Path First) in a single area (area 0) across a larger, multi-network topology. You will connect three routers with multiple LAN segments, each serving several PCs, and enable OSPF to dynamically share routes. This lab will strengthen your understanding of OSPF neighbor relationships, cost metrics, and link-state advertisements in a more realistic enterprise-style network.

Step-by-Step Instructions
Step 1: Build the Topology in Packet Tracer
Devices Required:
3 Routers (R1,R2,R3) Cisco 2811 ( Note:Make sure to add modules on the router for serial interface)
15 PCs (PC1–PC15)
Switches (1 per LAN segment)
Serial & Ethernet cables

Connections:
LAN 1: PC1–PC5 → Switch1 → R1 (FastEthernet0/0)
LAN 2: PC6–PC10 → Switch2 → R2 (FastEthernet0/0)
LAN 3: PC11–PC15 → Switch3 → R3 (FastEthernet0/0)
WAN Links:
R1 (Serial0/0/0) ⟶ R2 (Serial0/0/0)
R2 (Serial0/0/1) ⟶ R3 (Serial0/0/0)

Note:
Power off routers before adding WIC-2T modules for serial connections.
Power them back on after modules are installed.


Step 2: Configure Router Hostnames
On R1:
Router> enable
Router# configure terminal
Router(config)# hostname R1
On R2:
Router> enable
Router# configure terminal
Router(config)# hostname R2
On R3:
Router> enable
Router# configure terminal
Router(config)# hostname R3


Step 3: Configure IP Addresses on Router Interfaces
R1:
R1(config)# interface FastEthernet0/0
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# no shutdown
R1(config)# interface Serial0/0/0
R1(config-if)# ip address 10.0.0.1 255.0.0.0
R1(config-if)# no shutdown
R2:
R2(config)# interface FastEthernet0/0
R2(config-if)# ip address 192.168.2.1 255.255.255.0
R2(config-if)# no shutdown
R2(config)# interface Serial0/0/0
R2(config-if)# ip address 10.0.0.2 255.0.0.0
R2(config-if)# no shutdown
R2(config)# interface Serial0/0/1
R2(config-if)# ip address 11.0.0.1 255.0.0.0
R2(config-if)# no shutdown
R3:
R3(config)# interface FastEthernet0/0
R3(config-if)# ip address 192.168.3.1 255.255.255.0
R3(config-if)# no shutdown
R3(config)# interface Serial0/0/0
R3(config-if)# ip address 10.0.0.6 255.255.255.252
R3(config-if)# no shutdown


Step 4: Configure IP Addresses on PCs
LAN 1 (PC1–PC5):
IP Range: 192.168.1.10 – 192.168.1.14
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.1.1

LAN 2 (PC6–PC10):
IP Range: 192.168.2.10 – 192.168.2.14
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.2.1

LAN 3 (PC11–PC15):
IP Range: 192.168.3.10 – 192.168.3.14
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.3.1


Step 5: Enable OSPF Routing Protocol (Single Area)
R1:
R1(config)# router ospf 1
R1(config-router)# network 192.168.1.0 0.0.0.255 area 0
R1(config-router)# network 10.0.0.0 0.0.0.3 area 0
R2:
R2(config)# router ospf 1
R2(config-router)# network 192.168.2.0 0.0.0.255 area 0
R2(config-router)# network 10.0.0.0 0.0.0.3 area 0
R2(config-router)# network 10.0.0.4 0.0.0.3 area 0
R3:
R3(config)# router ospf 1
R3(config-router)# network 192.168.3.0 0.0.0.255 area 0
R3(config-router)# network 10.0.0.4 0.0.0.3 area 0


Step 6: Verify Routing Tables
On all routers:
R1# show ip route
R2# show ip route
R3# show ip route
You should see OSPF-learned routes marked with an "O" code.


Step 7: Test Connectivity
From PC1 → ping PC12 (192.168.3.x)
From PC8 → ping PC4 (192.168.1.x)
From PC14 → ping PC7 (192.168.2.x)
Expected Result: All pings succeed if OSPF is correctly configured.



Final Notes
This lab simulates a small enterprise network with multiple LANs connected via OSPF in a single area. It demonstrates how OSPF dynamically shares routes, adapts to topology changes, and ensures full connectivity without static routes.