CCNA Day 24 Lab: Standard ACL Configuration and Verification


Lab Objective: The objective of this lab is to configure a Standard Access Control List (ACL) to block all traffic from a specific host while allowing all other traffic in a small routed network. You will learn how to create, apply, and verify a Standard ACL, understand wildcard masks, and follow Cisco’s best‑practice placement rules. This lab builds your skills in basic traffic filtering and access control.

Step by Step Instructions
Step 1: Build the Topology in Packet Tracer Devices Required:
2 Routers (R1, R2) Cisco 2811
3 PCs (PC1, PC2, PC3)
2 Switches
Serial & Ethernet cables


Note: Power off both routers before adding WIC‑2T modules to enable Serial interfaces. After inserting the modules, power the routers back on so that Serial0/0/0 becomes available for configuration.


Connections:
PC1 and PC2 → Switch1 → R1 (FastEthernet0/0)
PC3 → Switch2 → R2 (FastEthernet0/0)
R1 (Serial0/0/0) ⟶ R2 (Serial0/0/0)


Step 2: Configure Router Hostnames
On R1:
Router> enable
Router# configure terminal
Router(config)# hostname R1
On R2:
Router> enable
Router# configure terminal
Router(config)# hostname R2


Step 3: Configure IP Addresses on Router Interfaces
R1:
R1(config)# interface FastEthernet0/0
R1(config-if)# ip address 192.168.10.1 255.255.255.0
R1(config-if)# no shutdown
R1(config)# interface Serial0/0/0
R1(config-if)# ip address 10.0.0.1 255.255.255.252
R1(config-if)# no shutdown
R2:
R2(config)# interface FastEthernet0/0
R2(config-if)# ip address 192.168.2.1 255.255.255.0
R2(config-if)# no shutdown
R2(config)# interface Serial0/0/0
R2(config-if)# ip address 10.0.0.2 255.255.255.252
R2(config-if)# no shutdown


Step 4: Configure IP Addresses on PCs
PC1: IP: 192.168.1.10 Subnet Mask: 255.255.255.0 Default Gateway: 192.168.1.1
PC2: IP: 192.168.1.11 Subnet Mask: 255.255.255.0 Default Gateway: 192.168.1.1
PC3: IP: 192.168.2.10 Subnet Mask: 255.255.255.0 Default Gateway: 192.168.2.1


Step 5: Configure Static Routing
On R1:
R1(config)# ip route 192.168.20.0 255.255.255.0 10.0.0.2
On R2:
R2(config)# ip route 192.168.10.0 255.255.255.0 10.0.0.1


Step 6: Configure Standard ACL to Block PC1
On R2:
R2(config)# access-list 1 deny 192.168.1.1 0.0.0.0
R2(config)# access-list 1 permit any
R2(config)# interface Serial0/0/0
R2(config-if)# ip access-group 1 in
This configuration blocks all traffic from PC1 (192.168.1.1) inbound on R2’s Serial0/0/0 interface, while allowing all other traffic.


Step 7: Verify ACL Configuration
On R2:
R2# show access-lists
R2# show running-config | include access-group
R2# show ip interface Serial0/0/0


Step 8: Test Connectivity
From PC1 → ping PC3 (192.168.20.10) → should fail
From PC2 → ping PC3 (192.168.20.10) → should succeed


Final Notes: 
This lab demonstrates how Standard ACLs filter traffic based solely on source IP addresses. You’ve learned how to create, apply, and verify a Standard ACL, and why placing it close to the destination is recommended to avoid blocking other traffic unnecessarily.