CCNA Day-18 Lab: RIP Routing Configuration and Verification

Lab Objective
The objective of this lab is to configure RIP (Routing Information Protocol) between routers to enable automatic route sharing across networks. You’ll build a simple topology with two routers and two PCs, assign IP addresses, configure interfaces, and enable RIP to dynamically exchange routes. This lab strengthens your understanding of dynamic routing logic, RIP metrics, and route propagation.

Step-by-Step Instructions
Step 1: Build the Topology in Packet Tracer
Devices Required:
2 Routers (R1 and R2)
2 PCs (PC1 and PC2)
Connections:
PC1 ⟶ R1 (FastEthernet0/0)
R1 ⟶ R2 (Serial0/0/0)
R2 ⟶ PC2 (FastEthernet0/0)

Note:
Select the 2811 Router. Click the router → go to the Physical tab → click the green light to power off. Attach the WIC-2T module in the black slots under “Original Size” (zoom in if needed). Click the green light again to power on the router.

Step 2: Configure Router Hostnames
On R1:
Router> enable  
Router# configure terminal  
Router(config)# hostname R1
On R2:
Router> enable  
Router# configure terminal  
Router(config)# hostname R2


Step 3: Configure IP Addresses on Router Interfaces
On R1:
R1(config)# interface FastEthernet0/0  
R1(config-if)# ip address 192.168.1.1 255.255.255.0  
R1(config-if)# no shutdown  
R1(config)# interface Serial0/0/0  
R1(config-if)# ip address 10.0.0.1 255.0.0.0 
R1(config-if)# no shutdown

On R2:
R2(config)# interface FastEthernet0/0  
R2(config-if)# ip address 192.168.2.1 255.255.255.0  
R2(config-if)# no shutdown  
R2(config)# interface Serial0/0/0  
R2(config-if)# ip address 10.0.0.2 255.255.255.252  
R2(config-if)# no shutdown


Step 4: Configure IP Addresses on PCs
On PC1;
IP Address: 192.168.1.10
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.1.1

On PC2:
IP Address: 192.168.2.10
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.2.1


Step 5: Enable RIP Routing Protocol
On R1:
R1(config)# router rip  
R1(config-router)# version 2  
R1(config-router)# network 192.168.1.0  
R1(config-router)# network 10.0.0.0

On R2:
R2(config)# router rip  
R2(config-router)# version 2  
R2(config-router)# network 192.168.2.0  
R2(config-router)# network 10.0.0.0


Step 6: Verify Routing Tables
On both routers:
R1# show ip route  
R2# show ip route
You should see RIP-learned routes marked with an “R” code.

Step 7: Test Connectivity
From PC1:
Ping PC2 (192.168.2.10)
From PC2:
Ping PC1 (192.168.1.10)
Expected Result: Successful ping replies if RIP is correctly configured and routes are dynamically learned.

Final Notes
This lab demonstrates how RIP automates route sharing between routers, reducing manual configuration. While RIP is simple and easy to set up, it uses hop count as its metric and is best suited for small networks. For larger environments, protocols like EIGRP or OSPF offer better scalability and control.